console.log('number' + 3 + 3); /* number33, 
коли один з операндів є строковим, 
JavaScript перетворює інший операнд на стороку, 
число '3' перетворюється на строку '"3"',
оператор '+' використовується для конкатинації строк, '"number" + "3"' => "number3", 
строка '"number3"' і число '3' перетворюється на строку '"3"', 
'"number3" + "3"' => "number33" */

console.log(null + 3); /* 3, при використанні математичних операцій 'null' перетворюється на '0', '0 + 3 = 3'*/

console.log(5 && "qwerty"); /* && логічний оператор 'і', => перевірка 2-х умов,
повертає перше значення якщо false і друге значення якщо true, 
всі числа окрім '0' => true, будь-яка строка окрім порожньої "" => true
5 => true, qwerty => true, обидва операнди є true, тому повертається другий операнд */ 

