console.log('number' + 3 + 3); /* number33, 
коли один з операндів є строковим, 
JavaScript перетворює інший операнд на рядок, 
число '3' перетворюється на строку '"3"',
оператор '+' використовується для конкатинації строк, '"number" + "3"' => "number3", 
рядок '"number3"' і число '3' перетворюється на рядок '"3"', 
'"number3" + "3"' => "number33" */

console.log(null + 3); /* 3
при використанні математичних операцій 'null' перетворюється на '0', '0 + 3' => 3 */

console.log(5 && "qwerty"); /* 5qwerty
 && логічний оператор 'і', => перевірка 2-х умов,
повертає перше значення якщо false і друге значення якщо true, 
всі числа окрім '0' => true, будь-який рядок окрім порожньої "" => true
5 => true, qwerty => true, обидва операнди є true, тому повертається другий операнд */ 

console.log(+'40' + +'2' + 'hillel'); /* 42hillel
унарний '+' перетворює рядок на число, рядок '"40" та "2"' перетворюєится на числа '40 та 2',
два операнди є числами виконується математичне додавання чисел '40 + 2' => 42
'hillel' є рядком отже виконується перетворення числа '42' на рядок '"42"' 
і відбувається конкатинація '"42" + "hillel"' => "42hillel" */

console.log('10' - 5 === 6); /* false
оператор '-' арифметичний, рядок '"10"' перетворюється на число '10',
два операнди є числами виконується математичне віднімання чисел '10 - 5' => 5
'===' строгий оператор порівняння, який перевіряє рівність значень та рівність типів операндів, 
5 != 6 , результат порівняння = false */

console.log(true + false); /* 1
відбувається приведення типів до числа і виконується  арифметичне додавання чисел
true = 1, false = 0, '1 + 0' => 1 */

console.log('4px' - 3); /* Nan
виконується спроба арифметичного віднімання та переведення рядка в число
рядок '4px' містить символи які не можуть бути частиною валідного числа, результатом приведення буде спеціальне значення NaN (not a number)
'NaN - 3' будь-яка арефметична дія з NaN завжди повертає NaN */

console.log('4' - 3); /* 1
виконується спроба арифметичного віднімання та переведення рядка в число
рядок '"4"' перетворюється на число '4'
два операнди є числами виконується математичне віднімання чисел '4 - 3' => 1 */

console.log('6' + 3 ** 0); /* 61
виконується урахування пріоритету операторів та автоматичне перетворення типів даних
оператор '**' має вищий пріоритет, ніж оператор додавання, тому спочатку виконується операція експоненції
'3 ** 0' => 1, оскільки будь-яке число (крім нуля) у ступені 0 дорівнює 1.
один із операндів є рядком '"6"', відповідно число '1' перетворюється на рядок '"1"'
виконується операція конкатенації '"6" + "1"' => "61" */




